Инструменты/src/Catalogs/УИ_ДанныеДляОтладки/УИ_ДанныеДляОтладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УИ_ДанныеДляОтладки</name>
  <attributes>
    <name>ТипОбъектаОтладки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбъектаОтладки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Инструменты/src/Catalogs/УИ_Алгоритмы/УИ_Алгоритмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УИ_Алгоритмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстАлгоритма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кэшировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбрасыватьИсключение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьВТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьОшибкиВЖР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторHTTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Вход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Инструменты/src/Catalogs/УИ_ДанныеДляОтладки/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	
	
		Запрос=Новый Запрос;
		Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	УИ_Алгоритмы.Ссылка
	|ПОМЕСТИТЬ Алго
	|ИЗ
	|	Справочник.УИ_Алгоритмы КАК УИ_Алгоритмы";
	Запрос.Выполнить();
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	УИ_Алгоритмы.Ссылка,
	|	УИ_Алгоритмы.ВерсияДанных,
	|	УИ_Алгоритмы.ПометкаУдаления,
	|	УИ_Алгоритмы.Родитель,
	|	УИ_Алгоритмы.ЭтоГруппа,
	|	УИ_Алгоритмы.Код,
	|	УИ_Алгоритмы.Наименование,
	|	УИ_Алгоритмы.ТекстАлгоритма,
	|	УИ_Алгоритмы.Хранилище,
	|	УИ_Алгоритмы.Комментарий,
	|	УИ_Алгоритмы.Кэшировать,
	|	УИ_Алгоритмы.НаКлиенте,
	|	УИ_Алгоритмы.ВыбрасыватьИсключение,
	|	УИ_Алгоритмы.ВыполнятьВТранзакции,
	|	УИ_Алгоритмы.ЗаписыватьОшибкиВЖР,
	|	УИ_Алгоритмы.ИдентификаторHTTP,
	|	УИ_Алгоритмы.ИдентификаторРегламентногоЗадания,
	|	УИ_Алгоритмы.ВыполнятьПоРасписанию,
	|	УИ_Алгоритмы.Параметры.(
	|		Ссылка,
	|		НомерСтроки,
	|		Вход,
	|		Имя,
	|		ТипПараметра,
	|		ПоУмолчанию,
	|		Ссылка,
	|		НомерСтроки,
	|		Вход,
	|		Имя,
	|		ТипПараметра,
	|		ПоУмолчанию),
	|	УИ_Алгоритмы.Предопределенный,
	|	УИ_Алгоритмы.ИмяПредопределенныхДанных,
	|	УИ_Алгоритмы.Представление,
	|	УИ_Алгоритмы.Ссылка,
	|	УИ_Алгоритмы.ВерсияДанных,
	|	УИ_Алгоритмы.ПометкаУдаления,
	|	УИ_Алгоритмы.Родитель,
	|	УИ_Алгоритмы.ЭтоГруппа,
	|	УИ_Алгоритмы.Код,
	|	УИ_Алгоритмы.Наименование,
	|	УИ_Алгоритмы.ТекстАлгоритма,
	|	УИ_Алгоритмы.Хранилище,
	|	УИ_Алгоритмы.Комментарий,
	|	УИ_Алгоритмы.Кэшировать,
	|	УИ_Алгоритмы.НаКлиенте,
	|	УИ_Алгоритмы.ВыбрасыватьИсключение,
	|	УИ_Алгоритмы.ВыполнятьВТранзакции,
	|	УИ_Алгоритмы.ЗаписыватьОшибкиВЖР,
	|	УИ_Алгоритмы.ИдентификаторHTTP,
	|	УИ_Алгоритмы.ИдентификаторРегламентногоЗадания,
	|	УИ_Алгоритмы.ВыполнятьПоРасписанию,
	|	УИ_Алгоритмы.Предопределенный,
	|	УИ_Алгоритмы.ИмяПредопределенныхДанных,
	|	УИ_Алгоритмы.Представление
	|ИЗ
	|	Справочник.УИ_Алгоритмы КАК УИ_Алгоритмы
	|ГДЕ
	|	УИ_Алгоритмы.ИдентификаторHTTP = &ИдентификаторHTTP";
	Запрос.УстановитьПараметр("ИдентификаторHTTP", "раз два");
	Запрос.УстановитьПараметр("Таблица", Новый ТаблицаЗначений);
	Запрос.УстановитьПараметр("Массив", Новый Массив);
	Запрос.УстановитьПараметр("Список", Новый СписокЗначений);
	Результат=Запрос.Выполнить();
	УИ.От(Запрос);
	
КонецПроцедуры
